; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p31-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (OBJ p23)
    (OBJ p24)
    (OBJ p25)
    (OBJ p26)
    (OBJ p27)
    (OBJ p28)
    (OBJ p29)
    (OBJ p30)
    (at t0 l0-1)
    (at t1 l1-2)
    (at t2 l2-1)
    (at p0 l2-1)
    (at p1 l1-0)
    (at p2 l1-2)
    (at p3 l2-2)
    (at p4 l0-1)
    (at p5 l2-1)
    (at p6 l0-1)
    (at p7 l1-0)
    (at p8 l2-2)
    (at p9 l2-0)
    (at p10 l0-0)
    (at p11 l1-0)
    (at p12 l1-0)
    (at p13 l1-0)
    (at p14 l2-1)
    (at p15 l2-1)
    (at p16 l0-1)
    (at p17 l1-2)
    (at p18 l0-1)
    (at p19 l2-0)
    (at p20 l2-2)
    (at p21 l2-1)
    (at p22 l1-0)
    (at p23 l1-0)
    (at p24 l2-0)
    (at p25 l1-1)
    (at p26 l1-0)
    (at p27 l2-2)
    (at p28 l0-1)
    (at p29 l1-0)
    (at p30 l0-0)
    (at a0 l1-0)
)
(:goal
    (and
        (at p0 l2-0)
        (at p1 l2-1)
        (at p2 l0-2)
        (at p3 l0-0)
        (at p4 l1-0)
        (at p5 l0-1)
        (at p6 l1-1)
        (at p7 l2-0)
        (at p8 l2-2)
        (at p9 l1-1)
        (at p10 l1-0)
        (at p11 l2-1)
        (at p12 l0-0)
        (at p13 l0-2)
        (at p14 l0-1)
        (at p15 l1-0)
        (at p16 l1-0)
        (at p17 l2-2)
        (at p18 l1-0)
        (at p19 l0-0)
        (at p20 l0-0)
        (at p21 l1-0)
        (at p22 l2-1)
        (at p23 l0-1)
        (at p24 l2-0)
        (at p25 l0-1)
        (at p26 l0-2)
        (at p27 l2-1)
        (at p28 l2-0)
        (at p29 l1-1)
        (at p30 l1-2)
    )
)
)

; plan
1. (load-truck p5 t2 l2-1)
   deleted: (at p5 l2-1)
   added: (in p5 t2)
   goals met: 2 of 31
2. (load-truck p21 t2 l2-1)
   deleted: (at p21 l2-1)
   added: (in p21 t2)
   goals met: 2 of 31
3. (load-truck p15 t2 l2-1)
   deleted: (at p15 l2-1)
   added: (in p15 t2)
   goals met: 2 of 31
4. (load-truck p14 t2 l2-1)
   deleted: (at p14 l2-1)
   added: (in p14 t2)
   goals met: 2 of 31
5. (load-truck p0 t2 l2-1)
   deleted: (at p0 l2-1)
   added: (in p0 t2)
   goals met: 2 of 31
6. (load-truck p2 t1 l1-2)
   deleted: (at p2 l1-2)
   added: (in p2 t1)
   goals met: 2 of 31
7. (load-truck p17 t1 l1-2)
   deleted: (at p17 l1-2)
   added: (in p17 t1)
   goals met: 2 of 31
8. (load-truck p6 t0 l0-1)
   deleted: (at p6 l0-1)
   added: (in p6 t0)
   goals met: 2 of 31
9. (load-truck p4 t0 l0-1)
   deleted: (at p4 l0-1)
   added: (in p4 t0)
   goals met: 2 of 31
10. (load-truck p28 t0 l0-1)
   deleted: (at p28 l0-1)
   added: (in p28 t0)
   goals met: 2 of 31
11. (load-truck p18 t0 l0-1)
   deleted: (at p18 l0-1)
   added: (in p18 t0)
   goals met: 2 of 31
12. (load-truck p16 t0 l0-1)
   deleted: (at p16 l0-1)
   added: (in p16 t0)
   goals met: 2 of 31
13. (load-airplane p7 a0 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 a0)
   goals met: 2 of 31
14. (load-airplane p26 a0 l1-0)
   deleted: (at p26 l1-0)
   added: (in p26 a0)
   goals met: 2 of 31
15. (load-airplane p23 a0 l1-0)
   deleted: (at p23 l1-0)
   added: (in p23 a0)
   goals met: 2 of 31
16. (load-airplane p22 a0 l1-0)
   deleted: (at p22 l1-0)
   added: (in p22 a0)
   goals met: 2 of 31
17. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 2 of 31
18. (load-airplane p12 a0 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 a0)
   goals met: 2 of 31
19. (load-airplane p11 a0 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a0)
   goals met: 2 of 31
20. (load-airplane p1 a0 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 2 of 31
21. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 2 of 31
22. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 2 of 31
23. (unload-truck p21 t2 l2-0)
   deleted: (in p21 t2)
   added: (at p21 l2-0)
   goals met: 2 of 31
24. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 2 of 31
25. (load-truck p3 t2 l2-2)
   deleted: (at p3 l2-2)
   added: (in p3 t2)
   goals met: 2 of 31
26. (load-truck p27 t2 l2-2)
   deleted: (at p27 l2-2)
   added: (in p27 t2)
   goals met: 2 of 31
27. (load-truck p20 t2 l2-2)
   deleted: (at p20 l2-2)
   added: (in p20 t2)
   goals met: 2 of 31
28. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 2 of 31
29. (unload-truck p6 t0 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 2 of 31
30. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 2 of 31
31. (unload-truck p28 t0 l0-0)
   deleted: (in p28 t0)
   added: (at p28 l0-0)
   goals met: 2 of 31
32. (unload-truck p18 t0 l0-0)
   deleted: (in p18 t0)
   added: (at p18 l0-0)
   goals met: 2 of 31
33. (unload-truck p16 t0 l0-0)
   deleted: (in p16 t0)
   added: (at p16 l0-0)
   goals met: 2 of 31
34. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 2 of 31
35. (unload-truck p3 t2 l2-0)
   deleted: (in p3 t2)
   added: (at p3 l2-0)
   goals met: 2 of 31
36. (unload-truck p20 t2 l2-0)
   deleted: (in p20 t2)
   added: (at p20 l2-0)
   goals met: 2 of 31
37. (unload-truck p15 t2 l2-0)
   deleted: (in p15 t2)
   added: (at p15 l2-0)
   goals met: 2 of 31
38. (unload-truck p14 t2 l2-0)
   deleted: (in p14 t2)
   added: (at p14 l2-0)
   goals met: 2 of 31
39. (unload-truck p0 t2 l2-0)
   deleted: (in p0 t2)
   added: (at p0 l2-0)
   goals met: 3 of 31
40. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 3 of 31
41. (unload-truck p27 t2 l2-1)
   deleted: (in p27 t2)
   added: (at p27 l2-1)
   goals met: 4 of 31
42. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 4 of 31
43. (load-truck p29 t1 l1-0)
   deleted: (at p29 l1-0)
   added: (in p29 t1)
   goals met: 4 of 31
44. (unload-truck p2 t1 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 4 of 31
45. (unload-truck p17 t1 l1-0)
   deleted: (in p17 t1)
   added: (at p17 l1-0)
   goals met: 4 of 31
46. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 4 of 31
47. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 4 of 31
48. (unload-truck p29 t1 l1-1)
   deleted: (in p29 t1)
   added: (at p29 l1-1)
   goals met: 5 of 31
49. (load-truck p25 t1 l1-1)
   deleted: (at p25 l1-1)
   added: (in p25 t1)
   goals met: 5 of 31
50. (load-airplane p17 a0 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 a0)
   goals met: 5 of 31
51. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 5 of 31
52. (unload-truck p25 t1 l1-0)
   deleted: (in p25 t1)
   added: (at p25 l1-0)
   goals met: 5 of 31
53. (load-airplane p25 a0 l1-0)
   deleted: (at p25 l1-0)
   added: (in p25 a0)
   goals met: 5 of 31
54. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 5 of 31
55. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 5 of 31
56. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 5 of 31
57. (load-airplane p30 a0 l0-0)
   deleted: (at p30 l0-0)
   added: (in p30 a0)
   goals met: 5 of 31
58. (load-airplane p28 a0 l0-0)
   deleted: (at p28 l0-0)
   added: (in p28 a0)
   goals met: 5 of 31
59. (unload-airplane p26 a0 l0-0)
   deleted: (in p26 a0)
   added: (at p26 l0-0)
   goals met: 5 of 31
60. (load-truck p26 t0 l0-0)
   deleted: (at p26 l0-0)
   added: (in p26 t0)
   goals met: 5 of 31
61. (unload-airplane p25 a0 l0-0)
   deleted: (in p25 a0)
   added: (at p25 l0-0)
   goals met: 5 of 31
62. (load-truck p25 t0 l0-0)
   deleted: (at p25 l0-0)
   added: (in p25 t0)
   goals met: 5 of 31
63. (unload-airplane p23 a0 l0-0)
   deleted: (in p23 a0)
   added: (at p23 l0-0)
   goals met: 5 of 31
64. (load-truck p23 t0 l0-0)
   deleted: (at p23 l0-0)
   added: (in p23 t0)
   goals met: 5 of 31
65. (unload-airplane p2 a0 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 5 of 31
66. (load-truck p2 t0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 5 of 31
67. (load-airplane p18 a0 l0-0)
   deleted: (at p18 l0-0)
   added: (in p18 a0)
   goals met: 5 of 31
68. (load-airplane p16 a0 l0-0)
   deleted: (at p16 l0-0)
   added: (in p16 a0)
   goals met: 5 of 31
69. (unload-airplane p13 a0 l0-0)
   deleted: (in p13 a0)
   added: (at p13 l0-0)
   goals met: 5 of 31
70. (load-truck p13 t0 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 t0)
   goals met: 5 of 31
71. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 5 of 31
72. (load-airplane p9 a0 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a0)
   goals met: 5 of 31
73. (unload-airplane p7 a0 l2-0)
   deleted: (in p7 a0)
   added: (at p7 l2-0)
   goals met: 6 of 31
74. (load-airplane p5 a0 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 6 of 31
75. (load-airplane p3 a0 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a0)
   goals met: 6 of 31
76. (unload-airplane p28 a0 l2-0)
   deleted: (in p28 a0)
   added: (at p28 l2-0)
   goals met: 7 of 31
77. (unload-airplane p22 a0 l2-0)
   deleted: (in p22 a0)
   added: (at p22 l2-0)
   goals met: 7 of 31
78. (load-airplane p21 a0 l2-0)
   deleted: (at p21 l2-0)
   added: (in p21 a0)
   goals met: 7 of 31
79. (load-airplane p20 a0 l2-0)
   deleted: (at p20 l2-0)
   added: (in p20 a0)
   goals met: 7 of 31
80. (load-airplane p19 a0 l2-0)
   deleted: (at p19 l2-0)
   added: (in p19 a0)
   goals met: 7 of 31
81. (unload-airplane p17 a0 l2-0)
   deleted: (in p17 a0)
   added: (at p17 l2-0)
   goals met: 7 of 31
82. (load-airplane p15 a0 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 a0)
   goals met: 7 of 31
83. (load-airplane p14 a0 l2-0)
   deleted: (at p14 l2-0)
   added: (in p14 a0)
   goals met: 7 of 31
84. (unload-airplane p11 a0 l2-0)
   deleted: (in p11 a0)
   added: (at p11 l2-0)
   goals met: 7 of 31
85. (unload-airplane p1 a0 l2-0)
   deleted: (in p1 a0)
   added: (at p1 l2-0)
   goals met: 7 of 31
86. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 7 of 31
87. (unload-airplane p5 a0 l0-0)
   deleted: (in p5 a0)
   added: (at p5 l0-0)
   goals met: 7 of 31
88. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 7 of 31
89. (unload-airplane p3 a0 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 8 of 31
90. (unload-airplane p20 a0 l0-0)
   deleted: (in p20 a0)
   added: (at p20 l0-0)
   goals met: 9 of 31
91. (unload-airplane p19 a0 l0-0)
   deleted: (in p19 a0)
   added: (at p19 l0-0)
   goals met: 10 of 31
92. (unload-airplane p14 a0 l0-0)
   deleted: (in p14 a0)
   added: (at p14 l0-0)
   goals met: 10 of 31
93. (load-truck p14 t0 l0-0)
   deleted: (at p14 l0-0)
   added: (in p14 t0)
   goals met: 10 of 31
94. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 10 of 31
95. (unload-truck p5 t0 l0-1)
   deleted: (in p5 t0)
   added: (at p5 l0-1)
   goals met: 11 of 31
96. (unload-truck p25 t0 l0-1)
   deleted: (in p25 t0)
   added: (at p25 l0-1)
   goals met: 12 of 31
97. (unload-truck p23 t0 l0-1)
   deleted: (in p23 t0)
   added: (at p23 l0-1)
   goals met: 13 of 31
98. (unload-truck p14 t0 l0-1)
   deleted: (in p14 t0)
   added: (at p14 l0-1)
   goals met: 14 of 31
99. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 14 of 31
100. (unload-truck p26 t0 l0-2)
   deleted: (in p26 t0)
   added: (at p26 l0-2)
   goals met: 15 of 31
101. (unload-truck p2 t0 l0-2)
   deleted: (in p2 t0)
   added: (at p2 l0-2)
   goals met: 16 of 31
102. (unload-truck p13 t0 l0-2)
   deleted: (in p13 t0)
   added: (at p13 l0-2)
   goals met: 17 of 31
103. (unload-airplane p12 a0 l0-0)
   deleted: (in p12 a0)
   added: (at p12 l0-0)
   goals met: 18 of 31
104. (load-airplane p10 a0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a0)
   goals met: 18 of 31
105. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 18 of 31
106. (unload-airplane p9 a0 l1-0)
   deleted: (in p9 a0)
   added: (at p9 l1-0)
   goals met: 18 of 31
107. (load-truck p9 t1 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 t1)
   goals met: 18 of 31
108. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 18 of 31
109. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 18 of 31
110. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 19 of 31
111. (unload-airplane p30 a0 l1-0)
   deleted: (in p30 a0)
   added: (at p30 l1-0)
   goals met: 19 of 31
112. (load-truck p30 t1 l1-0)
   deleted: (at p30 l1-0)
   added: (in p30 t1)
   goals met: 19 of 31
113. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 19 of 31
114. (unload-truck p9 t1 l1-1)
   deleted: (in p9 t1)
   added: (at p9 l1-1)
   goals met: 20 of 31
115. (unload-truck p6 t1 l1-1)
   deleted: (in p6 t1)
   added: (at p6 l1-1)
   goals met: 21 of 31
116. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 21 of 31
117. (unload-truck p30 t1 l1-2)
   deleted: (in p30 t1)
   added: (at p30 l1-2)
   goals met: 22 of 31
118. (unload-airplane p21 a0 l1-0)
   deleted: (in p21 a0)
   added: (at p21 l1-0)
   goals met: 23 of 31
119. (unload-airplane p18 a0 l1-0)
   deleted: (in p18 a0)
   added: (at p18 l1-0)
   goals met: 24 of 31
120. (unload-airplane p16 a0 l1-0)
   deleted: (in p16 a0)
   added: (at p16 l1-0)
   goals met: 25 of 31
121. (unload-airplane p15 a0 l1-0)
   deleted: (in p15 a0)
   added: (at p15 l1-0)
   goals met: 26 of 31
122. (unload-airplane p10 a0 l1-0)
   deleted: (in p10 a0)
   added: (at p10 l1-0)
   goals met: 27 of 31
123. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 27 of 31
124. (load-truck p22 t2 l2-0)
   deleted: (at p22 l2-0)
   added: (in p22 t2)
   goals met: 27 of 31
125. (load-truck p17 t2 l2-0)
   deleted: (at p17 l2-0)
   added: (in p17 t2)
   goals met: 27 of 31
126. (load-truck p11 t2 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 t2)
   goals met: 27 of 31
127. (load-truck p1 t2 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 t2)
   goals met: 27 of 31
128. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 27 of 31
129. (unload-truck p22 t2 l2-1)
   deleted: (in p22 t2)
   added: (at p22 l2-1)
   goals met: 28 of 31
130. (unload-truck p11 t2 l2-1)
   deleted: (in p11 t2)
   added: (at p11 l2-1)
   goals met: 29 of 31
131. (unload-truck p1 t2 l2-1)
   deleted: (in p1 t2)
   added: (at p1 l2-1)
   goals met: 30 of 31
132. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 30 of 31
133. (unload-truck p17 t2 l2-2)
   deleted: (in p17 t2)
   added: (at p17 l2-2)
   goals met: 31 of 31
